# ValueAtPointBase Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ValueAtPointBase Class
Members See Also
---
A base class representing storage of values at a given point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class ValueAtPointBase : IDisposable
```

Visual Basic
---
```text
Public Class ValueAtPointBase _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ValueAtPointBase : IDisposable
```

# Remarks
This class stores a set of measurements and corresponding mapped flags. The flags are defined in the enumerated type ValueAtPointFlags.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ValueAtPointBase Autodesk.Revit.DB.Analysis..::..ValueAtPoint Autodesk.Revit.DB.Analysis..::..VectorAtPoint
# See Also
ValueAtPointBase Members
Autodesk.Revit.DB Namespace